# 데이터 불러오기

In [1]:
### 패키지 설치 
import pandas as pd #Analysis 
import matplotlib.pyplot as plt #Visulization
import seaborn as sns #Visulization
import numpy as np #Analysis 
from scipy.stats import norm #Analysis 
from sklearn.preprocessing import StandardScaler #Analysis 
from scipy import stats #Analysis 
import warnings 
warnings.filterwarnings('ignore')
%matplotlib inline
import gc

import os
import string
color = sns.color_palette()

%matplotlib inline

from plotly import tools
import plotly.offline as py
py.init_notebook_mode(connected=True)
import plotly.graph_objs as go

from sklearn import model_selection, preprocessing, metrics, ensemble, naive_bayes, linear_model
from sklearn.feature_extraction.text import TfidfVectorizer, CountVectorizer
from sklearn.decomposition import TruncatedSVD

pd.options.mode.chained_assignment = None
pd.options.display.max_columns = 999

import plotly.graph_objs as go

import time
import random

In [2]:
df=pd.read_csv('data/funda.csv')
df.head()

,store_id,card_id,card_company,transacted_date,transacted_time,installment_term,region,type_of_business,amount,year,month,dayofweek,year-month,season,quarter,hour,sido,city,holidays
0,0,0,b,2016-06-01,13:13,0,NaN,기타 미용업,1857.142857,2016,6,2,2016-6,summer,2,13,NaN,NaN,0
1,0,1,h,2016-06-01,18:12,0,NaN,기타 미용업,857.142857,2016,6,2,2016-6,summer,2,18,NaN,NaN,0
2,0,2,c,2016-06-01,18:52,0,NaN,기타 미용업,2000.000000,2016,6,2,2016-6,summer,2,18,NaN,NaN,0
3,0,3,a,2016-06-01,20:22,0,NaN,기타 미용업,7857.142857,2016,6,2,2016-6,summer,2,20,NaN,NaN,0
4,0,4,c,2016-06-02,11:06,0,NaN,기타 미용업,2000.000000,2016,6,3,2016-6,summer,2,11,NaN,NaN,0

In [3]:
df.shape

(6556613, 19)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6556613 entries, 0 to 6556612
Data columns (total 19 columns):
 #   Column            Dtype
---  ------            -----
 0   store_id          int64
 1   card_id           int64
 2   card_company      object
 3   transacted_date   object
 4   transacted_time   object
 5   installment_term  int64
 6   region            object
 7   type_of_business  object
 8   amount            float64
 9   year              int64
 10  month             int64
 11  dayofweek         int64
 12  year-month        object
 13  season            object
 14  quarter           int64
 15  hour              int64
 16  sido              object
 17  city              object
 18  holidays          int64
dtypes: float64(1), int64(9), object(9)
memory usage: 950.4+ MB

In [5]:
df.isna().sum()

store_id                  0
card_id                   0
card_company              0
transacted_date           0
transacted_time           0
installment_term          0
region              2042766
type_of_business    3952609
amount                    0
year                      0
month                     0
dayofweek                 0
year-month                0
season                    0
quarter                   0
hour                      0
sido                2042766
city                2042766
holidays                  0
dtype: int64

In [6]:
%autosave 60

Autosaving every 60 seconds

# store_id 기준으로 region이 다른 값 있는지 확인

In [7]:
a=[]
store_unique=df.store_id.unique().tolist()

for i in store_unique:
    a.append(len(df[df['store_id']==i]['region'].unique()))

In [8]:
a=pd.DataFrame(a)

In [20]:
len(a)

1967

In [9]:
a[a[0]==1]

      0
0     1
1     1
2     1
3     1
4     1
...  ..
1962  1
1963  1
1964  1
1965  1
1966  1

[1967 rows x 1 columns]

In [10]:
a[a[0]>1]

Empty DataFrame
Columns: [0]
Index: []

* region의 unique값이 모두 1개임을 확인

# 환불 중 pair 없이 음수값 있는지 확인

In [11]:
# amount가 음수인 데이터만 
minus=df[df['amount']<0]

In [12]:
#환불 내역이 있는 점포 리스트
minus.store_id.unique()

array([   0,    1,    2, ..., 2134, 2135, 2136], dtype=int64)

In [15]:
minus_list=minus.store_id.unique().tolist()
b=[]
for i in minus_list:
    b.append(df[df['store_id']==i]['amount'].sum())

In [16]:
b=pd.DataFrame(b)

In [19]:
len(b)

1965

In [17]:
b[b[0]<0]

Empty DataFrame
Columns: [0]
Index: []

In [18]:
b[b[0]>0]

                 0
0     2.417447e+07
1     3.668643e+06
2     8.843000e+06
3     2.990096e+07
4     1.086164e+07
...            ...
1960  2.263390e+07
1961  1.104016e+07
1962  8.147500e+06
1963  1.814721e+07
1964  5.090033e+07

[1965 rows x 1 columns]